Revit 2026 API

# XYZDotProduct Method

---

The dot product of this vector and the specified vector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double DotProduct(
	XYZ source
)
```
```vb
Public Function DotProduct (
	source As XYZ
) As Double
```
```cpp
public:
double DotProduct(
	XYZ^ source
)
```
```fsharp
member DotProduct :
        source : XYZ -> float
```

#### Parameters

source XYZ
    The vector to multiply with this vector.

#### Return Value

DoubleThe real number equal to the dot product.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when source is . |

The dot product is the sum of the respective coordinates of the two vectors: Vx*Wx + Vy*Wy + Vz*Wz. Also known as scalar product or inner product.

#### Reference

XYZ Class

Autodesk.Revit.DB Namespace